import React from "react";
import { Formik, Form, Field } from "formik";
import * as Yup from "yup";
import SelectInput from "../Formik/SelectInput"; // Your SelectInput component
import Button from "../Button"; // Your Button component
import { useTranslation } from "react-i18next"; // For translation

const PlantDiseaseForm = () => {
  const { t } = useTranslation(); // Translation hook

  // Mock options for plants and diseases
  const plantOptions = [
    {
      english_name: "Grape",
      label: "العنب",
      scientific_name: "Vitis vinifera",
      description:
        "ذكر العنب في القرآن الكريم كفاكهة من ثمرات الجنان، و عرف بطعمه اللذيذ المميز وتعدد ألوانه وأنواعه. وتعد ثمر العنب من الثمار التى لها ملمس ناعم  وذات لب عصيرى تنمو على شجرة العنب فى شكل عناقيد و تظهر الثمار على عناقيد يوجد فيها عادة ما بين ست ثمرات إلى ثلاثمائة ثمرة.  وتتفاوت الوان ثمار العنب حسب انواعة و أصنافه تتراوح اللوانة من  سوداء أو زرقاء أو بنفسجية أو ذهبية اللون تميل إلى الخضرة أو بيضاء   فى الاكل المباشر او عمل الذبيب والذى يتم استخدامة فى عمل الحلويات كما يستخدم ورق العنب فى عمل انواع مختلفة من وجبة المحشى فى البلدان المختلفة . ويعدّ العنب من الفواكه ذات القيمة الغذائية والعلاجية الجيد حيث يتميز انواعة باحتوائه على نسبة جيدة من المواد السكرية سريعة الامتصاص وسهلة الهضم حيث يتركز سكر الجلوكوز وسكر الفركتوز  بشكل كبير ويتميز كذلك العنب بغنائه بالفيتامينات مثل فيتامين ج - كما يحتوي على نسبة جيدة من العناصر المعدنية مثل Vit- B وكذلك فيتامين ب ؛ ويحتوي على أملاح معادن البوتاسيوم والكالسيوم والصوديوم. كما يحتوي العنب على مستويات عاليه من الألياف المفيدة لصحة القلب وجهاز الدوران، كما يعد مصدراً غنياً للفيتامينات والمعادن الهامة لجسم الإنسان كالمغنيسيوم والحديد والكالسيوم وغيرهم، مما يجعله مضاداً طبيعياً للأكسدة والوقاية من أمراض القلب والأوعية الدموية والسرطانات والكثير من الأمراض الأخرى. وكغيره من المحاصيل الزراعية تصاب عناقيد العنب بالعديد من الآفات الحشرية والأمراض الزراعية",
      farm_id: 1,
      value: 18,
      created_at: "2025-01-20T16:32:10",
      updated_at: "2025-01-20T16:32:10",
    },
    {
      english_name: "Citrus",
      label: "الحمضيات",
      scientific_name: "Citrus",
      description:
        "تعتبر الموالح اهم انواع الفاكهة واكثرها انتشارا على الاطلاق ويطلق عليعا الحمضيات وترجع اهميتها للمميزات الاقتصادية التى تتميز بها بين انوع الفاكهة الاخرى حيث تعتبر الفكهة الشعبية للعدي من الشعوب العربية نظرا لقيمتها الغذائية العالية ورخص اسعارها وتواجدها لاكبر فترة ممكنة طوال العام بالاضافة انها تتمتع بسمعة عالمية فى الاسواق فى الخارج لصفات ثمارها المميزة. والموالح هى مجموعة من اشجار الفاكهة تتميز بوجود غدد زيتية فى اوراقها تكسبها رائحة عطرية مميزة. تنتشر زراعة اشجار الموالح فى انواع مختلفة من التربة ولكن تعتبر التربة التى يترواح قوامها من الطينية الخفيفة الى التربة الرملية الجيدة الصرف والتهوية والحامضية هى أفضل انواع الاراضى لزراعة الموالح. إنتاج الموالح  معرض دائما للتهديد من قبل مسببات الأمراض والافات التي تتسبب في خسائر اقتصادية كبيرة وآثار اجتماعية شديدة.  و اصابة الموالح بالعديد من الافات المرضية والحشرية يتوقف على الاصل ونوع الطعم والمناخ ومشتوى الماء الارضى ونوعية مياة الرى وكمياتها والتسميد وطرق الزراعة ",
      farm_id: 1,
      value: 15,
      created_at: "2025-01-20T16:07:52",
      updated_at: "2025-01-20T16:07:52",
    },
    {
      english_name: "Coffee",
      label: "",
      scientific_name: "",
      description: "",
      farm_id: 1,
      value: 16,
      created_at: "2025-01-20T16:16:23.285388",
      updated_at: "2025-01-20T16:16:23.285392",
    },
    {
      english_name: "Honey Bees",
      label: "",
      scientific_name: "",
      description: "",
      farm_id: 1,
      value: 19,
      created_at: "2025-01-20T16:35:20.697586",
      updated_at: "2025-01-20T16:35:20.697590",
    },
    {
      english_name: "Roses",
      label: "الورد",
      scientific_name: "Roses",
      description:
        "يعتبر الورد  من اهم نباتات الزينة التى يستخدمة معظم البلدان المختلفة حيث يدخل في ثقافة الكثير من الشعوب، اضافة إلى استخدامها في المنازل والحدائق للزينة فهو أيضاً يستخدم في المناسبات الرسمية وحفلات الزواج،  ومن العادات التى كانت تستخدمها الشعوب ومستمرة حتى الان انة كان يرش ماء الورد على العروسين كرمز لينعم العروسين بالطمأنينة والسعادة، هذا التقليد وجد له أساس علمي لوجود مواد معينة في ماء الورد الدمشقي تعمل كمادة مهدئة، ومضادة للاكتئاب، وتعطي شعوراً بالاسترخاء، وتخفف التوتر. ونظرًا لتعدّد أنواع  الورود واختلافها عن بعضها البعض فى الشكل واللون وقدرتها على المقاومة للافات  فإنّ مقاومتها للأمراض والافات الحشرية  وطرق الوقاية  التى تتطلّبها تختلف تِبعًا لحالة ونوعية الورود، لذلك عند القيام  باختيار أنواع الورود  محددة لكى يتم زراعتها عليه اختيار الأصناف  والتركيب الوراثية التي تتطلب قدرًا من العناية يساوي ما يمكنه تقديمه.\r\nفيما يلى سوف  نذكر أنواع بعض الامراض والافات الحشرية التي قد تصيب الورود طرق الوقاية. \r\n",
      farm_id: 1,
      value: 21,
      created_at: "2025-01-20T17:05:13",
      updated_at: "2025-01-20T17:05:13",
    },
    {
      english_name: "Pomegranate",
      label: "رمان",
      scientific_name: "Punica granatum",
      description:
        "تعتبر شجرة الرومان من اشجار الفواكهة الهامة فى السعودية والعالم . وهى شجرة قديمة العهد جدا. والاسم العلمي للرمان Punica granatum  معناه الثمرة الحمراء ذات البذور الرمان هو من الاشجار المباركة مثل التين والزيتون والنخيل والعنب حيث ورد ذكرها فى القرآن الكريم ، ويعتبر الرمان من أهم محاصيل الفاكهة التى تنمو فى بلدان العالم  والتى يعتمد عليها كثير من المزارعين. وقد أقبل المزارعون على زراعته في السنوات الأخيرة بعدما أصبح من المحاصيل الهامة تصديريا. ونظرا للقيمه الغذائية والصحية العالية  لثمار الرمان فانة یوجد طلب عالمى متزاید على ثمارة وهو من اشجار الفاكهة المتحملة للجفاف والملوحة اضافة ان شجرة الرمان تنمو فى أنواع مختلفة من الاراضى ملائمة الظروف البیئیة  المختلفة لنمو الاشجار وانتاج نوعیة جیدة من الثمار. وكذلك يعتبر الرمان من محاصيل الفاكهة التى يسهل اكثارها نظرا لسرعة نموها واثمارها ومن المميزات التى يتمبز بها ايضا ان الرمان سھل التداول والتخزین لثماره. الا انةهناك بعض التحديات التى تواجة التوسع فى زراعتة   ومن اهم هذة التحديات  قابلیة الاشجار والثمار للاصابة بالعدید من الحشرات والامراض والاضرار الفسیولوجیة",
      farm_id: 1,
      value: 20,
      created_at: "2025-01-20T16:56:48",
      updated_at: "2025-01-28T08:23:52.520941",
    },
  ];

  const diseaseOptions = [
    {
      label: "fish_blood posion",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 28,
      created_at: "2025-01-20T16:29:14.163367",
      updated_at: "2025-01-20T16:29:14.163370",
    },
    {
      label: "fish_exophthalmos",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 29,
      created_at: "2025-01-20T16:31:20.722254",
      updated_at: "2025-01-20T16:31:20.722258",
    },
    {
      label: "citrus",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 46,
      created_at: "2025-01-20T20:05:37.992725",
      updated_at: "2025-01-20T20:05:37.992729",
    },
    {
      label: "fish",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 47,
      created_at: "2025-01-20T20:05:42.490998",
      updated_at: "2025-01-20T20:05:42.491001",
    },
    {
      label: "grape",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 48,
      created_at: "2025-01-20T20:05:45.641807",
      updated_at: "2025-01-20T20:05:45.641811",
    },
    {
      label: "pomegranate",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 49,
      created_at: "2025-01-20T20:05:49.802451",
      updated_at: "2025-01-20T20:05:49.802454",
    },
    {
      label: "roses",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 50,
      created_at: "2025-01-20T20:05:54.608070",
      updated_at: "2025-01-20T20:05:54.608073",
    },
    {
      label: "الحمضيات",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 51,
      created_at: "2025-01-20T20:06:10.874858",
      updated_at: "2025-01-20T20:06:10.874862",
    },
    {
      label: "الرمان",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 52,
      created_at: "2025-01-20T20:06:25.928617",
      updated_at: "2025-01-20T20:06:25.928621",
    },
    {
      label: "العنب",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 53,
      created_at: "2025-01-20T20:06:38.235990",
      updated_at: "2025-01-20T20:06:38.235993",
    },
    {
      label: "القهوه",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 54,
      created_at: "2025-01-20T20:06:48.878599",
      updated_at: "2025-01-20T20:06:48.878602",
    },
    {
      label: "الورد",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 55,
      created_at: "2025-01-20T20:06:54.410718",
      updated_at: "2025-01-20T20:06:54.410722",
    },
    {
      label: "نحل العسل",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: null,
      stages: [],
      value: 56,
      created_at: "2025-01-20T20:07:13.266183",
      updated_at: "2025-01-20T20:07:13.266187",
    },
    {
      label: "citrus_bacterial canker",
      arabic_name: "تقرح الحمضيات  ",
      scientific_name: "Xanthomonas citri pv. citri",
      symptoms:
        "تبقى البكتريا المسببة لمرض تقرح الموالح على قيد الحياة في الاجزاء النباتية المصابة مثل الأوراق والأفرع والثمار، بالإضافة إلى التربة الملوثة والأسطح المختلفة، بما في ذلك الأدوات والمعدات المستخدمة في بساتين الموالح. دورة مرض تقرح الموالح تبدا بإدخال البكتيريا المسببة للمرض  إلى بساتين الموالح، وتدخل البكتيريا  المسببة الى النبات عن طريق  الفتحات الطبيعية مثل الثغور أو الجروح الناتجة عن الرياح أو البرد أو الأضرار الميكانيكية. بمجرد دخول البكتريا النبات، تتكاثر البكتيريا وتسبب الاعراض على الأوراق والأفرع والثمار. خلال فترات الطقس الرطب، تتدفق البكتيريا من الاعراض الموجودة فى الاجزاء النباتية  وتنتشر عن طريق الرياح أو الأمطار أو المياه المتناثرة إلى أجزاء أخرى من النبات أو إلى الأشجار المجاورة. يمكن أيضًا أن تبقى البكتيريا على قيد الحياة في بقايا النبات أو التربة أو على الأسطح الملوثة، مما يشكل مصادر محتملة للعدوى للمواسم الزراعية المقبلة.",
      description:
        "ينتشر  مرض تقرح الموالح عن طريق الأمطار التي تحركها الرياح، و تنشر خلايا البكتيريا الى مسافات بعيدة. وكذلك ينقل المرض  عن طريق الاجزاء النباتية المصابة أو الأدوات والمعدات الملوثة، اضافة الى حركة العمال داخل حقول الموالح.كما تساعد الظروف الدافئة والرطبة وفترات هطول الأمطار الغزيرة أو الري بالرش على انتشار المرض وتطوره. كما ان الأنسجة النباتية الحديثة وهى أكثر عرضة للإصابة من الأنسجة الناضجة والمتصلبة",
      treatments:
        "1.\tتنظيف  وتعقيم أدوات التقليم بالنقع في محلول الكلوركس 10 % لمدة 5 دقائق او بمحلول الأمونيوم الرباعي\r\n2.\tزراعة الشتلات السليمة المأخوذة من مشاتل خالية من المرض . \r\n3.\tالتخلص من الأشجار الميتة بحرقها حتى لا تكون مصدر للعدوى .\r\n4.\tإجراء التقليم الجيد وكشط و إزالة التقرحات التى تكون مصدراً للعدوى العام المقبل وبعد التقليم يتم الدهان المكشوطة بعجينة بوردو التي تتكون من 1 كجم كبريتات نحاس + 1 كجم جير حي + 10 لتر ماء على أن يتم الدهان بواسطة فرشله للجزء المصاب مع حزء من النسيج السليم حول البقعة المصابة أو الرش بمبيد كرانش ( مادته الفعالة كبريتات النحاس ) 10 % SP بمعدل 125 جم / 100 لتر ماء .\r\n5.\tالتسميد المتوازن.\r\n6.\t استخدام مواد إكثار خالية من مسببات الأمراض\r\n7.\tالرش الوقائي بمبيدات الفطريات النحاسية\r\n8.\t  مكافحة في حشرة صانعة الأنفاق (Phyllocnistis citrella) \r\n",
      stages: [],
      value: 18,
      created_at: "2025-01-20T16:07:52",
      updated_at: "2025-01-20T16:07:52",
    },
    {
      label: "citrus_greening",
      arabic_name: "اخضرار الموالح ",
      scientific_name: "Huanglongbing",
      symptoms:
        "تظهر الاعراض المميزة لهذا المرض هى اصفرار قمم الفروع العليا للشجرة، وظهور تبرقش على شكل بقع على الأوراق (جزر خضراء على الاوراق) اضافة الى وجود اصفرار عكسى على الثمرة حيث يبدأ اصفرارها من قاعدتها المشدودة بالساق وليس من قمتها كما هو في الحالات العادية عند نضوج الثمرة و تظهر الثمار غير منتظمة مشوهة وغير متماثلة ، وحجم صغير، وزيادة سمك القشرة، ونضج غير منتظم، وفشل تكوين البذور، وعروق برتقالية اللون  وفى النهاية تموت النباتات المصابة.",
      description:
        "يوجد هذا  المرض في كثير من الدولة فى أنحاء العالم  وهو مرض بكتيري يصيب الموالح، تتسببه بكتيريا من جنس ‘Candidatus Liberibacter‘ وهو من الامراض الخطيرة التى يصعب مكافحتها وكان يعرف هذا المرض فى الماضى بمرض الاخضرار (Greening)، وقد تم التخلى عن هذا الاسم نظرا لانها لا تعكس التسمية الاعراض الحقيقة التى يسببها هذا المرض. وعرف هذا المرض فى الصين باعراض اصفرار القمم وعرف واشتهر بهذا الاسم الا انة اعتمد التسمية الجديدة عند المختصين وهى “هوانغ-لونغ-بينغ” (Huang-Long-Bing: HLB) وهو ما يترجم بمرض اصفرار القمم  (Yellow Shoot Disease)، ويمكن إذا أردنا اختصاره بالعربية بكلمة “هلب” (HLB) مسايرة لما هو شائع عند أغلب علماء العالم.  كان العلماء الصينيون عام  1956 يعتبرو أن هذا المرض يتسبب عن  فيروسوتبين بعد ذلك  سنة 1984 أنه ناتج عن مسبب مرضى بكتيرى  حيث تمّ تشخيص أنواع  مختلفة لهذا المسبب. وينتشر المرض بواسطة حشرة السيلايد الاسيوية Asian citrus psyllid والشتلات المصابة.   ومن الاسماء الشائعة لهذا المرض مرض الغصن الاصف , مرض الورقه المبرقشه ,  مرض تحطم اللحاء و مرض الاخضرار",
      treatments:
        "1.\tالتسميد المتوازن \r\n2.\tالفحص الدورى للحقول المنزرعة بالموالح \r\n3.\tاستخدام واستخدام اصول وطعم خالى من الاصابة اثناء عملية التطعيم للموالح \r\n4.\tازالة النباتات والافرع المصابة وحرقها خارج الحق \r\n5.\t  مكافحة ناقلات البكتيريا من الحشرات (Diaphorina spp. psyllids)  \r\n",
      stages: [],
      value: 19,
      created_at: "2025-01-20T16:08:18",
      updated_at: "2025-01-20T16:08:18",
    },
    {
      label: "citrus_gummosis",
      arabic_name: "تصمغ اشجار الحمضيات",
      scientific_name: "Botryotinia fuckeliana",
      symptoms:
        "تظهر الاعراض على الجذور الرئيسيه على شكل تقرحات تشمل القشره حتى تصل الخشب كذلك تحصل الاصابة على الاشجار الكبيرة في منطقة التطعيم .بتقدم الاصابة تتصلب القشرة وتتشقق طولياومع تطور المرض تظهر كميات من الصمغ مما يؤدي الى اصفرار الاوراق وسقوط ازهار الشجرة وبالنهاية تؤدي الى موت الشجرة. يلاحظ ايضا ذبول الاوراق الفجائي و  ذبول الاغصان الصغيرة الطرفية وموتها على مسافة 30-60سم من القمة في الظروف المناسبة يمتد المرض حتى يشمل الشجرة جميعها خاصة الاشجار الصغيرة",
      description:
        "يعتبر هذا المرض من الامراض المهمة في الاراضي الخصبه جدا والاراضي المنخفضه ورديئة الصرف ويظهر تأثيرالمرض على المحصول لانه يصيب الاغصان التي تحمل الثمار",
      treatments:
        "1-\t زراعة اصول مقاومة  مثل الخشخاش والفولكاماريانا\r\n2-\tان تكون منطقة التحام الطعم بالاصل على ارتفاع لا يقل عن 30سم عند زراعة الاشتال بالارض المستديمة\r\n3-\t تجنب حدوث اضرار ميكانيكية لجذع الشجرة والافرع الرئيسية والجذور\r\n4-\tعمل مصاطب حقلية حول جذع الشجرة لمنع مياه الري من ملامسة الشجرة\r\n5-\t مراقبة الاشجار باستمرار وكشف اسفل الساق لمعرفة الاصابة في بداية حدوثهاحتى تسهل مكافحته\r\n6-\t عند الاصابة تقشط جزء من الانسجة المصابة بواسطة سكين حاد مع إزالة جزء من الانسجة السليمة ثم تدهن بمحلول فطري نحاسي\r\n7-\t طلاء سيقان اشجار الحمضيات سنويا بمحلول بوردو المكون من 2كغم كبريتات النحاس: 5كغم جير:10لترماء\r\n8-\t   معاملة التربة بعد خلع الاشجار المصابة باحدى المعقمات الكيماوية او المبيدات الفطرية النحاسية\r\n9-\t تقوية الاشجار عن طريق تسميدها والاعتناء بتصريف المياه الزائدة بالري\r\n10-\t قص الافرع المصابة وحرقها مع طلاء مكان القص ب مسحوق بوردو\r\n",
      stages: [],
      value: 20,
      created_at: "2025-01-20T16:08:42",
      updated_at: "2025-01-20T16:08:42",
    },
    {
      label: "coffee_cerscospora",
      arabic_name: "مرض بقعة العين البنية ",
      scientific_name: "Cercospora coffeicola",
      symptoms:
        "تظهر  العراض على شكل بقع بنية في الأوراق والأنسجة المتولدة حديثًا  تبدأ عند حواف أوراق القهوة وتنتشر باتجاه المركز. يمكن أيضًا رؤية المرض على الأغصان، بدءًا من البقع التي سقطت فيها الأوراق.",
      description:
        "تنبت الجراثيم الكونيدية تحت ظروف رطوبة عالية وتنشا الهيفات الفطرية على طول سطح الورقة وتدخل الى الاوراق من السطح السفلى من خلال الثغور وتستمر فى النمو داخل الاوراق حتى تبدا البقع فى الظهور بعد اربع اسابيع من الاصابة الاولية وبعد ذلك يحدث التجرثم بعد 3 اسابيع من ظهور البقع على الاوراق وتؤثر الظروف البيئية على معدل تطور وظهور المرض وقد يحدث الانبات للجراثيم فى درجات حرارة تتراوح من 8-30 درجة مئوية على الرغم ان درجة الحراة 27 هى الحراة المثلى. وتبقى الجراثيم حية على سطح الاوراق لمدة شهرين وتنتشر عن طريق الرياح ورزاز المطر وتعتبر الاوراق المتساقطة مصدر اساسيا للعدوى فى نهاية موسم الجفاف مع تزايد الاصابة فى النباتات المجهدة.",
      treatments:
        "1.\tالتسميد المتوازن يفيد فى التحكم فى هذا المرض  \r\n2.\tاضافة  المواد العضوية إلى التربة  ، \r\n3.\tالتهوية الجيدة عن طريق الزراعة على مسافات مناسبة والتقليم\r\n4.\t  استخددام المبيدات الفطريه التي تحتوي على النحاس والتريازول فعالة في مكافحة هذا المرض.\r\n",
      stages: [],
      value: 24,
      created_at: "2025-01-20T16:16:23",
      updated_at: "2025-01-20T16:16:23",
    },
    {
      label: "honey bees_bee eater",
      arabic_name: "طائر الوروار ",
      scientific_name: "Merops apiaster",
      symptoms:
        "ملاحظة الطيور وهي تطير بالقرب من الخلايا في محاولة للإمساك بالنحل.      - انخفاض في عدد النحل العامل في الخلايا.",
      description:
        "يهاجم طائر الوروار خلايا النحل بشكل رئيسي في أوقات الخروج الجماعي للنحل، حيث يتغذى على النحل الطائر.",
      treatments:
        "- وضع شبكات أو أسلاك حول الخلايا لحمايتها من الطيور.\r\n     - بناء أسطح أو حواجز تعيق الطيور من الوصول إلى الخلايا.\r\n",
      stages: [],
      value: 33,
      created_at: "2025-01-20T16:35:20",
      updated_at: "2025-01-20T16:35:20",
    },
    {
      label: "citrus_mealybug",
      arabic_name: "بق الحمضيات الدقيقى  ",
      scientific_name: "Planococcus citri Risso",
      symptoms:
        "تتغـذى الحشـرات البالغـة والحوريـات وتمتـص عصـارة  الثمار أو الأوراق أو السـيقان أو الأفـرع، وتفرز ندوة عسـلية تكـون سـببا في نمـو العفـن الأسـود، وتجمـع الأتربـة فتعيـق التمثيل الضوئـي وهو مـا يقلل من إنتاجيـة الأشـجار وتـردي نوعيتها خاصـة في حالة الإصابـة الشـديدة وتضعف نموهـا وقـد تتسـبب في موتهـا. وتسبب الندوة العسلیة التى ينمو علیھا الفطر الھبابى مسبب اصفرار الأوراق وتساقطھا وجفاف الأفرع، وعند انتقال الإصابة إلى الثمار تسبب تشوھھا وعدم وصولھا إلى الحجم الطبیعىوبالتالى تنخفض قیمتھا التسويقی",
      description:
        "تتبـع حشرة بـق الموالـح الدقيقـي رتبة نصفيـات الأجنحة ويغطي جسـمها بإفرازات دقيقة أو شـمعية تشـبه الخيـوط الحريريـة، ويحـاط بزوائـد شـمعية ولهـا أشـكال خاصـة. الأنثـى البالغـة تكون بيضاويـة الشـكل يصـل طولهـا إلى  5 ملم وهـي مـن الحشـرات الثاقبـة الماصـة للعصـارة النباتيـة. ويحيـط بجسـم الأنثـى 17 زوجـا مـن الزوائـد الشـمعية القصيرة المتسـاوية في الطـول، والزوج الذنبـي منها قد يطول ويبلغ عشـرة أمثـال طـول الزوائـد الأخـرى. ويكـون لون الحشـرة وردي خفيف أو سـمني وتكون  الذكـور نادرة الوجـود ولونها أصـــفر غامـق أو بني فاتـح.",
      treatments:
        "1.\tترك مسافات بين الاشجار من 5 الى 7 امتر حسب طبيعة المنطقة والظروف الجوية لضمان التهوية اللازمة \r\n2.\tعد الافراط فى الرى لتجنب ارتفاع الرطوبة حول الاشجار \r\n3.\tالتقليم الجيد لتعريض الاشجار لاشعة الشمس والرياح لمنع انتشار هذة الحشرة.\r\n4.\tالرش بالزيوت المعدنية مع مبيد حشرى موصى بة فى  التوقيت المناسب وجرعات مناسبة\r\n5.\tاستخدام الاعداء الحيوة من اهمها Cryptolaemus montrouzieri Mulsant    وحشـــــــرة أبـو العـــيد Leptomastix dactypii Howard \r\n6.\tوتعالج ھذه الحشرة صیفاً باستخدام أحد الزيوت الصیفیة مثل زيت سوبر مصرونا أو زيت سوبر رويال أو زيت كزد أويل وذلك بتركیز    ١.٥ لتر /٦٠٠لتر.\r\n",
      stages: [],
      value: 21,
      created_at: "2025-01-20T16:11:54",
      updated_at: "2025-01-20T16:11:54",
    },
    {
      label: "citrus_mediterranean fruit fly",
      arabic_name: "ذبابة فاكهة دول حوض البحر الابيض المتوسط ",
      scientific_name: "Ceratitis capitata Wied",
      symptoms:
        "تظهر الاعراض على شكل تثقب ناتج عن وضع الانثى للبيض بشكل مباشر فى الثمرة فى لب او تحت قشرة الثمرة . يدخل عن طريق هذا الثقب الفطريـات والبكتيريـا و التي تسـبب تغير لـون الثمـرة إلى الأصـفر الباهـت ومن ثم تتعــفن، وتتغذى اليرقات على لـب الثمار تاركة مخلفاتهـا داخـل الثمـرة وهـو مـا يجعـل الجـزء المصـاب رخـوا وتصبـح الثمار غيـر صالحة لاسـتهاك وتتلـف تماما وتتسـاقط",
      description:
        "تعتبر ذبابة الفاكهة احد اهم الافات الحشرية واكثرها انتشارا على اشجار الفاكهة  وهى من  الحشرات ثنائية الأجنحة، تتطفل  على اشجار الفاكهة وتسبّب لها الكثير من الأضرار. تتواجد طوال العام ، وتصيب هذه الحشرة معظم ثمار الفواكه المعروفة في مصر و منطقة حوض البحر المتوسط  مثل الخوخ والمشمش والكمثري والبرقوق والتفاح والمانجو والجوافة والتين والباباظ والموالح بمختلف أنواعها،  اضافة الى بعض العوائل الثانوية مثل  محاصيل الخضر ومنها الطماطم ، وتعبر الحشرة من الحشرات ذات التطور الكامل (البيضة ، اليرقة ، العذراء والحشرة الكاملة )",
      treatments:
        "1-\tتجنب زراعة الحمضيات بجانب انواع اخرى من اشجار الفاكهة تكون عائلا لحشرة ذبابة الفاكهة.\r\n2-\tوجـد بعـض العوائـل الثانويـة للذبابـة مـن الضـروري ازالتهـا أو جمع ثمارهـا قبل تمـام النضج لكـي لا تكـون مصـدر عدوى\r\n3-\tوجمع ثمـار الحمضيات  المصابة والمتسـاقطة في أكياس وتعريضهـا للشـمس أو دفنهـا في حفـرة لا يقـل عمقهـا عـن 40سـم لإعاقـة خـروج الحشـرة الكاملـة،\r\n4-\tوتقليـب التربـة تحـت الأشـجار تقليبا ً سـطحيا لتعريض العذارى إلى أشـعة الشـمس.\r\n5-\tضـع المصائـد الغذائيـة بأعـداد كبيـرة ( 50مصيدة/هكتار) و تسـتهدف الحشـرة الكاملة خاصـة الإنـاث الباحثـة عـن البروتينـات لبلـوغ النضـج الجنسـي، وهـي مـن طـرق المكافحـة الصديقـة للبيئـة التـي تسـاهم في الحـد مـن تكاثـر وتزايـد أعـداد الآفـة\r\n6-\tإطـاق أعـداد كبيـرة مـن الذكـور العقيمـة بعـد تعريضهـا لأشـعة غامـا، فتنافـس الذكور العقيمـة الذكـور الأخـرى عـى الإنـاث ويكـون نسـلها عقيـم\r\n7-\tاستخدام  المكافحة الحيوية لذبابة البحر المتوسط وتعتمد على  استخدام الطفيلين\r\nاللذيـن Diachasmimorpha longicaudata (Ashmead) وOpius                concolor (Psyttalia) تـم اسـتخدامهما مـع إطـاق الذكـور العقيمـة وسـاهما في الحـد مـن أضـرارهـا.\r\n8-\tالرش الجزئى باستخدام الرش الجزئى بمعدل ٢/١لتر لیباسید + ١لتر بومینال يكمل المحلول إلى ٢٠لتر بالماء أى ملء رشاشة ظھرية ٢٠لتر ويتم رش جذع الشجرة لكل أشجار الحديقة أو يرش خط من الأشجار ويترك أخر أو يرش خط ويترك خطان ويتوقف عدد خطوط الأشجار المعاملة وكذلك عدد الرشاشات فى الموسم على كثافة الذبابة فى المصائد.\r\n9-\tاستخدام ما يسمى بالحزم القاتلة وھى عبارة عن كیس خیش أسطوانى بطول ٢٠سم وقطر ١٠سم ومحشو أيضا بالخیش ويتم غمر الأكیاس فى المخلوط السابق ذكره فى الرش الجزئى (٢/١لتر لیباسید + ١لتر بومینال يكمل المحلول إلى ٢٠لتر بالماء أى ملء رشاشة ظھرية ٢٠لتر)  لفترة لاتقل عن ٤ساعات حتى يتم التشبع ثم تعلق على الأشجار بحیث لاتلامس الثمار اطلاقا ويجب أن تظل الأكیاس مبللة دائما وذلك بمداومة تزويدھا بالمخلوط. وتجدر الإشارة إلى أنه يمكن استخدام الرش الجزئى فقط ولكن لاتستخدم الحزم القاتلة بمفردھا وإنما تستخدم مع الرش الجزئي. وفى حالة استخدام البولیكورفى الحزم القاتلة يكون بنسبة ١٠٠سم ٣ملاثیون + ٢٠٠سم ٣بولیكور ويكمل المحلول إلى ٢٠لتر بالماء.\r\n",
      stages: [],
      value: 22,
      created_at: "2025-01-20T16:14:51",
      updated_at: "2025-01-20T16:14:51",
    },
    {
      label: "citrus_quick decline",
      arabic_name: "التدهور السريع فى الحمضيات ",
      scientific_name: "Citrus Tristeza",
      symptoms:
        " تعتبر أعراض التقزم، تنقر الساق، شحوب الأوارق وصغر حجم الثمار الأكثر شيوعاً في أصناف الحمضيات المختلفة. كما تظهر أعراض التدهور ومن ثم موت النبات على الأصناف المطعمة على أصل البرتقال الحامض و المعروف بالنارنج أو الزفير أو أبو صفير .وقد تبدأ الأعراض على فرع واحد، ثم تتلوه بقية أفرع الشجرة. وسقوط الأوراق يحدث بسرعة، يبدأ من قاعدة الفرع إلى قمته حتى تصبح الأفرع عارية تماماً. ونظرا لان هناك سلالات مختلفة من الفيروس المسبب CTV تعطي فابنها تعطى اعراضا  مختلفة على النباتات المصابة، ومنها ما يسبب تدهواًر سريعاً للنباتات المصابة وبالتالي موتها. ويلاحظ ان  الأشجار المصابة  تتجة إلى الإثمار بشدة في بداية المرض ويكون عدد الثمار كبير بالنسبة للنمو الخضري  الضعيف للشجرة المصابة ويعقب ذلك مرحلة التدهور التدهور التى سمى المرض باسمها . ",
      description:
        "ينتقل  فيروس tristeza  وسلالاتة المختلفة   عن طريق حشره المن الاسود، من خلال أمتصاصه لعصارة النبات المصاب ونقله للنبات السليم، وكذلك ينتقل من خلال  عملية التطعيم عن طريق الادوات الملوثة الملوثة بالفيروس، يمكن الكشف عن المرض في المختبر وذلك بإجراء فحص ELISA أو PCR. وينتشر فيروس تريستيزا بشكل سريع ويظهر تأثيره خلال أيام، وقد ينشر بشكل بطئ وتبقى الشجرة مصابة من اشهر الى سنوات، ويعود ذلك الى شدة الاصابة وتوفرالظروف الملائمة لانتشار الفيروس، حيث يفقد المن الاسود  فى بعض الوقت قدرته على نقل المرض خلال 24-48 ساعة.",
      treatments:
        "1.\tالزراعة على اصول مقاومة  لاصابة للفيروس \r\n2.\tوضع برنامج مكافحة مناسب لحشرات المن التى تصيب الموالح فى المشاتل والحقول\r\n3.\tاستبدال الأشجار المصابة بشدة باشجار مقاومة للمرض.\r\n4.\tالرش لمكافحة المن  بالبريثيوم والصابون الزراعي.\r\n5.\tغسل النبات بالماء لازالة المن.\r\n",
      stages: [],
      value: 23,
      created_at: "2025-01-20T16:15:54",
      updated_at: "2025-01-20T16:15:54",
    },
    {
      label: "grape_downy mildew",
      arabic_name: "البياض الزغبى ",
      scientific_name: "Plasmopara viticola",
      symptoms:
        "تظهر اعراض مرض البياض الزغبى فى العنب على هيئة بقع صغيرة صفراء شاحبة غير منتظمة الشكل على السطح العلوي للأوراق ويقابل هذه البقع على السطح السفلي نمو زغبي ابيض مع مرور الوقت  يتحول الى اللون الرمادي الداكن  وعند شدة الاصابة تموت الأوراق وتسقط  على الارض، وكذلك تظهر اعراض الاصابة  على  الاغصان الصغيرة الخضراء و الازهار  ومع مور الوقت تذبل وتتعفن، و تصاب العناقيد في الاطوار المختلفة فيتكون على العنقود نمو زغبي وتصبح الثمار داكنة اللون وجافة وصغيرة وتفقد قيمتها الاقتصادية.",
      description: null,
      treatments:
        "1.\tازالة  بقايا النباتات المصابة وحرقها أو دفنها عن طريق الحرث العميق وذلك للتخلص من الجراثيم البيضية التي تسبب الاصابة الأولية في الموسم المقبل .\r\n2.\tاستخدام طرق تقليم من شانه ا التخلص من الأفرع القريبة من التربة حيث يساعد ذلك على سهولة التهوية وسرعة جفاف الأوراق كما يقلل ايضاً من فرص انبات الجراثيم  السابحة المتساقطة على النموات الجديدة وحدوث الاصابة في الربيع .\r\n3.\tرش الاشجار بدايثين م 45 او كابتان 50 بتركيز 10 جم / جالون ماء ، أو بمخلوط بوردو %1% ويبدأ الرش قبل الازهار ويستمر كل 10 أيام أو أسبوعين حسب حالة الاصابة .\r\n4.\tتربية اصناف مقاومة من العنب\r\n",
      stages: [],
      value: 30,
      created_at: "2025-01-20T16:32:10",
      updated_at: "2025-01-20T16:32:10",
    },
    {
      label: "grape_mealybug",
      arabic_name: "بق العنب الدقيقى ",
      scientific_name: "Pseudococcus maritimus",
      symptoms:
        "تختلف قدرة هذة الحشرة على احداث اضرار على حساسية الاصناف للاصابة وتكون الإصابة شديدة على الأصناف التي تنتج عناقيد قريبة من الساق والأفرع الرئيسية وخاصة القريبة من قاعدة الساق. تنتج الأصابة على العناقيد من خلال إنتقال أكياس البيض القطنية واليرقات والطور الناضج والندوة العسلية إلى العناقيد. وعادة يظهر العفن الهبابي الأسود على الندوة العسلية في حال توفر الظروف الجوية المناسبة ذولك لان الحشرة تنتج ما يشبة الندوة لعسلية والتى ينمو عليها فطريات العفن الاسود . يوجد للبق الدقيقي ثلاث أجناس وجميعها قادرة على نقل الفيروسات إلى العنب.",
      description: null,
      treatments:
        "1.\tاستخدام المتطفلات:  ومن المتطفلات Anagyrus spp. , Leptomastix dactylopii\r\n2.\tاستخدام المفترسات و تعتبر الخنفساء ذات السبع نقطه ) Coccinellidae أبو العيد) أكثر المفترسات فعالية للبق الدقيقي وتعتبر من المفترسات المدمرة لحشرة البق الدقيقى.\r\n3.\tالمكافحة بالعمليات الزراعية يمكن إستخدام محاصيل جاذبة للنمل مثل زراعة محصول الجلبان   Vicia sativaكون النمل يعمل على حماية البق الدقيقي من المتطفلات كما أشارت بعض الدراسات وبالتالي يعمل على تقليل أعداد النمل في حقول العنب. كما يمكن تقليل إنتشار البق الدقيقي عن طريق إبعاد الأفرع والعناقيد الثمرية عن السيقان ومنع ملامستها كونها المصدر الرئيسي للإصابة\r\n4.\tإستخدام  المبيدات مثل مبيد    chlorpyrifos أو في أواخر الربيع بإستخدام مبيد  imidacloprid\r\n او يستخدم فى الصيف Thiamethoxam, Thiamethoxam+Lambda cyhalothrin      \r\n",
      stages: [],
      value: 31,
      created_at: "2025-01-20T16:33:12",
      updated_at: "2025-01-20T16:33:12",
    },
    {
      label: "grape_powdery mildew",
      arabic_name: "البياض الدقيقي  ",
      scientific_name: "Unicinula necator",
      symptoms:
        "تظهر عراض المرض  بظهور بقع بيضاء على جميع النموات الخضرية وبصورة واضحة على السطح العلوي للأوراق تتحول الى مسحوق طحيني ابيض تتسع البقع لتشمل جميع سطح الورقة وبذلك تظهر الورقة وكأنها مغطاة بالكامل بمسحوق أبيض وقد تلتف الورقة قليلاً الى اعلى في الاصابات الشديدة اثناء الجو الجاف الحار وكلما تقدمت الاصابة يتغير لون البقع الى البني واذا ظهرت الاصابة في العناقيد الزهرية تذبل وتتساقط ولاتعقد ثماراً واذا اصيبت الثمار حديثة العقد فيتكون عليها بقع فلينية وتتشوه شكلها وتتشقق الثمرة نتيجة لتأخير النمو في الاجزاء السليمة ",
      description:
        "يعيش الفطر فترة الشتاء على هيئة ميسيليوم نشط او كامن او كونيديا وذلك في الحدائق المنزلية على بعض الاغصان الغضة  خاصة في فصل الشتاء المعتدل أو يقضي فترة الشتاء على هيئة ثمار اسكية تتجمع في شقوق الاغصان المصابة ومع حلول فصل الربيع ينشط الميسيليوم وينتج كونيديا تصيب البراعم كما تنطلق الجراثيم الاسكية نتيجة انتفاخ وانفجار الثمار الاسكية وتسقط على الأوراق والنموات الجديدة لشجيرات العنب لتحدث الاصابة الأولية",
      treatments:
        "1 التقليم الجيد للشجيرات لتقليل تكاثف الاوراق والافرع  لضمان التهوية الجيدة مما يساعد على التهوية الجيدة وتقليل فرص الاصابة .\r\n2 يتم رش الشجيرات بعد ظهور الأوراق الجديدة بمركب دايثين م 45- بتركيز 10 جم جالون ماء او كارائين بتركيز 2 مل / جالون ماء ثم يكرر الرش كل اسبوعين\r\n",
      stages: [],
      value: 32,
      created_at: "2025-01-20T16:34:34",
      updated_at: "2025-01-20T16:34:34",
    },
    {
      label: "pomegranate_butterfly",
      arabic_name: "ابو دقيق الرمان",
      scientific_name: "Virachola livia",
      symptoms:
        "تتغذى اليرقات على البذور داخل الثمار واللب فتسبب تلف منطقة الاصابة ويزداد التلف بدخول الفطريات والبكتريا وكذلك ذبابة الفاكهة مما يسبب تعفن الثمار وتساقط نسبة كبيرة منها",
      description:
        "ليس لهذة الحشرة بيات شتوى حيث توجد اطوارها طول السنة فى قرون الاكاسيا وتظهر الحشرة بكثرة فى الربيع وتتزاوج الذكور مع الاناث التي تبدأ في وضع البيض بعد خروجها من العزراء بثلاث ايام  وتضع الانثى الواحدة 150 بيضة. يوضع البيض فرديا علي ثمار الرمان من الخارج ونادرا ما يوضع علي الأوراق او الازهار. يفقس البيض بعد 6 أيام وتتجول اليرقات حديثة الفقس على السطح الخارجي للثمرة ثم تثقبه إلى الداخل عن طريق قرضها لقشرة الثمار لتتغذي علي البذور  وتتلف كثير منها . تنسلخ اليرقة 3 انسلاخات ( يكون لها 4 أعمار يرقية تتم داخل الثمرة تتحول اليرقة بعدها الى عزراء   وذلك خلال أسبوعين وحوالي شهر ونصف في الشتاء (15-50) يوما.  تتحول اليرقات إلي عذاري داخل الثمار بالقرب من فتحة تعملها علي السطح الخارجي للثمرة وقد توجد العذارى علي الساق. يبلغ مدة طور العذراء - أيام صيفا الي حوالي 15-1.5 شهر خلال فصل الشتاء . للحشرة 6 أجيال على قرون الفتنة والسنط وجيل. واحد علي الرمان وجيل اخر على البلح (اي يكون لها لها  8 أجيال في السنة)",
      treatments:
        "1.\tإزالة أشجار السنط والفتنة المجاورة لمزارع الرمان أو النخيل وكذلك عدم زراعة الخروب والرمان متجاورين.\r\n2.\tجمع ثمار الرمان المتساقطة وإعدامها أولاً بأول.\r\n3.\tيتطفل على عذارى أبى دقيق الرمان طفيل Brachymeria aegyptiaca Masi، كما يتطفل على البيض الطفيل Trichogramma evanescens  Westw. وهذا النوع يمكن تربيته بسهولة وإطلاقه فى مزارع الرمان والنخيل ليتطفل على البيض.\r\n4.\t فى حالة الاصابات الشديدة يتم الرش بالمبيدات الحشرية ملاثيون 57% بمعدل 200سم3 لكل 100 لتر ماء - سوميثيون 50% بمعدل 250سم3 لكل 100 لتر ماء. - كلوربيروفوس 48% بمعدل 150سم3لكل 100 لتر ماء وذلك كل اسبوعين عندما تصبح الثمر فى حجم ثمر الليمون ويتم الرش الى ما قبل الجمع والتسويق باسبوعين \r\n",
      stages: [],
      value: 37,
      created_at: "2025-01-20T16:56:48",
      updated_at: "2025-01-20T16:56:48",
    },
    {
      label: "pomegranate_green peach aphid",
      arabic_name: "من الرمان",
      scientific_name: "Aphis punicae",
      symptoms:
        "توجد علي السطح العلوي للاوراق و النموات الحديثة الغضة الطرفية وخاصة علي الازهار في شهر مارس  يمتص المن العصارة النباتية  وتتسبب فى تجعد الاوراق باستخدام أجزاء الفم الثاقبة الماصة  يفرز افرازا عسليا (الندوة العسلية) علي اسطح الاوراق والبراعم  يمنع تكوين الثمار الندوة العسلية تؤدي الي تشويه الثمار وتقلل من القيمة التسويقية للثمار",
      description:
        "للحشرة عدة اجيال فى السنة وتقضى فترة الشتاء على شكل بيض مخصب فى قلف الاشجار وعلى الاغصان. يفقس البيض الذى تم وضعة فى فصل الربيع السابق الى حوريات وتتغذى الحوريات بامتصاص العصارة النباتية من النموات الحديثة لاوراق الرومان . فى الربيع تنسلخ الحوريات عدة انسلاخات وتتحول الى حورية غير مجنحة وتستمر فى ولادة حوريات ولعدة اجيال . يظهر فى الخريف جيل جنسى تتزاوج افرادة وتضع بيضا يبقى سابتا حتى الربيع القادم.",
      treatments:
        "1.\tيتم رش الاشجار بمبيد الملاثيون 57% مستحلب مركز بنسبة 150 \\100لتر ماء على ان يتوقف الرش قبل الحصاد والتسويق بالسبوعين \r\n2.\tموسبيلان 20% بمعدل 25جم \\100 لتر ماء \r\n3.\tاستخدام المكافحة الحيوبة بعض الدعاسيق ويرقات اسد المن او خنفساء ابو العيد \r\n4.\tيتطفل على هذا لانوع من المن بعض انواع الزنابير مثل Aphidius  , Aphelinus\r\n",
      stages: [],
      value: 38,
      created_at: "2025-01-20T17:00:15",
      updated_at: "2025-01-20T17:00:15",
    },
    {
      label: "pomegranate_mediterranean fruit fly",
      arabic_name: "ذبابة فاكهة دول حوض البحر الابيض المتوسط",
      scientific_name: "Certitis capitata",
      symptoms:
        "تظهر الاعراض على شكل تثقب ناتج عن وضع الانثى للبيض بشكل مباشر فى الثمرة فى لب او تحت قشرة الثمرة . يدخل عن طريق هذا الثقب الفطريـات والبكتيريـا و التي تسـبب تغير لـون الثمـرة إلى الأصـفر الباهـت ومن ثم تتعــفن، وتتغذى اليرقات على لـب الثمار تاركة مخلفاتهـا داخـل الثمـرة وهـو مـا يجعـل الجـزء المصـاب رخـوا وتصبـح الثمار غيـر صالحة لاسـتهاك وتتلـف تماما وتتسـاقط",
      description:
        "تعتبر ذبابة الفاكهة احد اهم الافات الحشرية واكثرها انتشارا على اشجار الفاكهة  وهى من  الحشرات ثنائية الأجنحة، تتطفل  على اشجار الفاكهة وتسبّب لها الكثير من الأضرار. تتواجد طوال العام ، وتصيب هذه الحشرة معظم ثمار الفواكه المعروفة في مصر و منطقة حوض البحر المتوسط  مثل الخوخ والمشمش والكمثري والبرقوق والتفاح والمانجو والجوافة والتين والباباظ والموالح بمختلف أنواعها،  اضافة الى بعض العوائل الثانوية مثل  محاصيل الخضر ومنها الطماطم ، وتعبر الحشرة من الحشرات ذات التطور الكامل (البيضة ، اليرقة ، العذراء والحشرة الكاملة ) ",
      treatments:
        "1.\tالقضاء على الذكور مكعبات من الياف نباتية يتم نقعها فى مخلوط من مركب يتكون من 90% ميثيل ايوجينول + 10% ملاثيون خام وتعلق داخل الاشجار ويتكرر ذلك كل 1-2 شهر حسب درجات الحرارة.\r\n2.\tاستخدام ما يسمى بالرش الجزئى لمكافحة ذبابة الفاكهة بعمل محلول من 1 لتر بومينال كمادة جاذبة غذائية :500 سم ملاثيون 57%+ 18.5 لتر ماء وترش حوالى 100سم3\\شجرة على جذوع الاشجار عند التفريعة اة مساحة متر 2 مع تفادى الثمار ويكرر الرش كل 15 يوم .\r\n",
      stages: [],
      value: 39,
      created_at: "2025-01-20T17:00:34",
      updated_at: "2025-01-20T17:00:34",
    },
    {
      label: "pomegranate_moth",
      arabic_name: "عثة الرمان",
      scientific_name: "Deudorix (virachola) livia   ",
      symptoms:
        "تسبب تساقط الثمار الحديثة العقد وتعفن للثمار الكبيرة وتلفها بسبب مهاجمة الفطريات وحشراة الدروسوفيلا وتصل نسبة الفقد فى بعض الاحيان الى 50%.",
      description:
        "تضع الانثى البيض فى قمع الثمرة ويكون ذلك فى منتصف شهر مايو ثم يفقس البيض وتتغذى الاعمار اليرقية على اسدية الثمرة . تعمل الاعمار اليرقية الاخيرة انفاقا فى منطقة اتصال القمع بالثمرة وتتغذى على القشرة بين حبات الرومان وتصبح منطقة الاصابة ملساء خوة حيث تدخلها الفطريات وتسبب عفن للثمرة واسوداد محتوياتها. ويعد اكتمال نمو اليرقة تعود مرة ثانية الى القمع لتتحول الى عذراء فى القمع وتخرج الحشرات الكاملة وتبدا الحشرات البالغة فى الخروج خلال الساعات الاولى من الليل للتزواج وتبدا بوضع البيض بعد يوم واحد من التزواج .وللحشرة ثلاث اجيال متداخلة فى السنة وتقضى فترة الشتاء على هيئة يرقة.",
      treatments:
        "1.\tجمع الثمار المصابة والمتساقسة والتخلص منها \r\n2.\tبعد عقد الثمار يتم حفظها وتغطيتها داخل اكياس ورقية ذات احجام مناسبة وعمل ثقوب بها للتهوية ولمنع وصول الاطوار البالغة من الحشرة اليها. \r\n3.\tإزالة أشجار السنط أو الطلح أو الآكاسي، كذلك شجرة الفتنة من مزارع الرومان \r\n4.\tعدم زراعة الخروب والرمان متجاورين، نظراً لإصابتهما بنفس الحشرة. \r\n5.\tاستخدام طفيل الترايكوجراما في مراحل شهر مارس حيث تضع الحشرة بيوضها فيتغذى الطفيل على البيض. \r\n6.\tفى حالة شدة الإصابة أو فى المناطق الموبوءة يمكن رش الأشجار دورياً (كل أسبوعين) للوقاية من الإصابة.\r\n7.\tويكون ذلك عندما تصبح الثمرة فى حجم ثمرة الليمون (فى جوان وجويلية) وإلى ماقبل الجمع والتسويق بأسبوعين على الأقل بأحد المركبات التالية:\r\n•\tكلوروبيروفوس 24% بمعدل 150 مل / 100 لتر ماء.\r\n•\tسوميثيون 50% مستحلب بمعدل 250مل/ 100 لتر ماء.\r\n•\tملاثيون 57% مستحلب بمعدل 200مل/ 100 لتر ماء  .\r\n•\tالرش بالمبيد الحشرى سوميسيدين 20% مستحلب مركز بمعدل  0. 5 سم3\\لتر\r\n",
      stages: [],
      value: 40,
      created_at: "2025-01-20T17:01:11",
      updated_at: "2025-01-20T17:01:11",
    },
    {
      label: "roses_black spot",
      arabic_name: "مرض البقعة السوداء",
      scientific_name: "Causal Pathogen",
      symptoms:
        "مرض البقعة السوداء يظهر على  السطح العلوي للوريقات على شكل  بقع سوداء دائرية الشكل  بقطر ٢-١٢ ملم  ثم تلتحم مع بعضها بشكل غير منتظم بحيث ينمو على حوافها نسيج الفطر الذي يأخذ الشكل الشعاعي حول البقعة. يظهر على السطح  العلوى الورقة بقع صغيرة موزعة عشوائيا بشكل دوائر متحدة المركز ويمكن ملاحظة كونيديا الفطر على شكل مناطق لزجة بيضاء لون على هذه البقع. يتحول أنسجة الورقة حول البقعة السوداء إلى اللون الاصفر الذي يمتد إلى كل سطح الوريقة التي تسقط في النهاية.",
      description:
        "ويعد من أمراض الورد المهمة في جميع أنحاء العالم،  ولة عدة مسميات اطلق على المرض لطخة الأوراق ، تبقع الأوراق ، اللطخة و يسمي هذا المرض أيضا عفن النجمة القائم ولا يشكل مشكلة خطيرة على نباتات الورد المزروعة في البيوت المحمية نظراً للتحكم في الرطوبة بشكل جيد أما على نباتات الورد التي تزرع في البستان فقد يصبح المرض وبائياً ويشكل مشكلة خطيرة .",
      treatments:
        "1.\tزراعة اصناف مقاومة لهذا المرض \r\n2.\tتفادى تعريض النباتات إلى الرطوبة العالية. \r\n3.\tعدم اتباع الزراعة الكثيفة والتهوية الجيدة داخل البيوت المحمية \r\n4.\tيجب تنظيف (إزالة) الأوراق وتقليم الأفرع المصابة بالبقع والتخلص منها في أسرع وقت \r\n5.\t الرش بالمبيدات الفطرية ضمن برنامج وقائي كل أسبوعين بمبيدات دياثين او مانكوزيب او النحاس او الكابتان او الثيرام وتعطى هذة المبيدات نتائج جيدة فى تقلبل خطورة المرض\r\n",
      stages: [],
      value: 41,
      created_at: "2025-01-20T17:05:13",
      updated_at: "2025-01-20T17:05:13",
    },
    {
      label: "roses_downy mildew",
      arabic_name: "البياض الزغبي في الورد",
      scientific_name: "Peronospora sparsa ",
      symptoms:
        "تظهر الاعراض على الأوراق وحامل الزهرة والأوراق الكأسية والبتلات. ويمكن . تشخيص المرض من خلال بقع بنفسجية إلى حمراء اللون على الأوراق الكبيرة مع اصفرار الأوراق الصغيرة. يمكن ملاحظة مناطق خضراء على نسيج الوريقات الصغيرة الصفراء بقطر اسم وقد يحدث سقوط الأوراق بدرجة كبيرة مما يؤدى الى ظهور الافرع عارية من الاوراق .",
      description:
        "تؤدى الاصابة بمرض البياض الزغبى فى الورد الى سرعة سقوط وفقدان الاوراق وظهور الافرع عارية ويؤدى ذلك الى موتها من اعلى الى اسفل وتموت الافرع فى حالات الاصابة الشديدة مما يؤدى الى حدوث خسائر اقتصادية كبيرة داخل الصوب ",
      treatments:
        "1.\tالتهوية الجيدة والري المعتدل للبيوت  المحمية\r\n2.\tتفادي الإنخفاض المفاجئ لدرجات الحرارة يساعد بشكل كبير في التقليل من شدة الإصابة. \r\n3.\tزراعة  النباتات والشتلات السليمة الخالية من أعراض الإصابة.\r\n4.\t إزالة الأوراق والأفرع الزهرية التي تعرضت للإصابة في الموسم السابق وذلك في نهاية موسم الشتاء وبداية الربيع والتخلص منها مما يساعد على منع بيات الفطر فيها إلى الموسم التالي  لتفادي تجدد ظهور الإصابة من موسم إلى آخر \r\n5.\tالرش بالمبيدات الفطرية عند الشك بتعرض النباتات لظروف مشجعة لظهور المرض.\r\n",
      stages: [],
      value: 42,
      created_at: "2025-01-20T19:31:00",
      updated_at: "2025-01-20T19:31:00",
    },
    {
      label: "roses_powdery mildew",
      arabic_name: "البياض الدقيقي في الازهار",
      scientific_name: "Sphaerotheoca pannasa rose ",
      symptoms:
        "فى المراحل الاولى للمرض تظهر الاعراض المرضيه على شكل نموات بيضاء من ميسيليوم الفطر المسبب على أنسجة الأفرع الفتية الغضة و بصفة خاصة قرب الأشواك الموجودة على الافرع.  اما على الاوراق الصغيرة تظهر النموات الفطرية البيضاء على السطح العلوي على شكل بقع متفرقة تنتشر على كل السطح مسببة التفاف حواف الوريقات إلى الداخل وتشوه مظهرها العام. وقد لا تتشوه الأوراق الكبيرة فى العمر في المراحل الأولى من الإصابة ولكن تتغطى سطحها العلوي ببقع دائرية أو  غير منتظمة من النمو الفطري الأبيض و وبتقدم الاصابة تسقط الأوراق في النهاية. عند مهاجمة الفطر للازهار  خاصة في المرحلة المبكرة قبل التفتح  وحيث ان  الفطر ينمو بصورة واضحة على منطقة حامل الزهرة تحت البرعم القمي إضافة إلى الأوراق الكاسية والبتلات  تقل  قدرة النبات على النمو الطبيعي وكذلك تؤدي إلى تراجع نوعية الأزهار المنتجة مما يفقدها قيمتها التسويقية واللاقتصادية.",
      description:
        "يعتبر مرض البياض الدقيقى فى الورد  من  أكثر الأمراض شيوعا و انتشاراً وخطورة على نباتات الورد الجوري  فى جميع مناطق زراعة الورد سواء في الزراعات المحمية  اوالحدائق على حد سواء، و يتواجد البياض الدقيقى في جميع الدول المنتجة للورد.",
      treatments:
        "1.\tانتاج اصناف من الورد  تحمل صفات المقاومة \r\n2.\t الطريقة الأكثر فاعلية في مقاومة هذا المرض هي الرش بالمبيدات الفطرية الجهازية التي من أهمها مبيدات روبیجان Rubigan والترايفورين Triforine مع تكرار الرش اسبوعيا ضمن برنامج مكافحة للمرض لتوفير الحماية للنموات الجديدة الغضة المعرضة للإصابة بشدة.\r\n3.\tالتخلص من الاوراق  المصابة التى سقطط  أسفل النباتات وتقليم الأفرع المصابة والتخلص منها بالسرعة الممكنة.\r\n4.\t التهوية الجيدة  تقلل من فرص الاصابة حيث التباين في نسبة الرطوبة بين الليل والنهار يؤثر على انتشار الفطر.\r\n",
      stages: [],
      value: 43,
      created_at: "2025-01-20T19:39:53",
      updated_at: "2025-01-20T19:39:53",
    },
    {
      label: "roses_rust",
      arabic_name: "صدأ الورد",
      scientific_name: "Phragmidium",
      symptoms:
        "تظهر الاعراض على شكل بثرات برتقالية  او بنية اللون على السطح السفلى للاوراق ثم تنتقل للجزء العلوى من الورقة وذلك فى بداية فصل الربيع . تصاب الأفرع الصغيرة وبتلات الأزهار مما يسبب تشوها.",
      description:
        "ينتشر هذا المرض على نبات الورد ويعتبر من الامراض الشائعة على الورد، وأكثر ما يصيب في بلادنا الأصناف المحلية كالورد الجوري أو ورد الشام وتوت السياج. تختلف أصناف الورد بحساسيتها للإصابة وبدرجة ظهور أعراض الإصابة . عليها، فقد تتغطى أوراق أحد الأصناف بصورة كاملة بالبثرات ولكنها تبقى متصلة بالنبات ولا تسقط بينما تسقط أوراق صنف آخر بسبب إصابتها . ببثرة مفردة من المرض.",
      treatments:
        "1.\tإزالة الأوراق وتقليم الأفرع المصابة المتبقية في نهاية موسم الشتاء قبل بدء النموات الجديدة على النباتات حيث تلعب هذة الطريقة الدور الأكبر في تقليل و تجدد وانتشار الإصابة خلال موسمي الربيع والصيف. \r\n2.\tوضع برنامج رش وقائى بالمبيدات الفطرية اسبوعيا عند تعرض النباتات لظروف مشجعة للإصابة مثل الرطوبة العالية وخاصة في الليل مع انخفاض درجات الحرارة.\r\n",
      stages: [],
      value: 44,
      created_at: "2025-01-20T20:00:00",
      updated_at: "2025-01-20T20:00:00",
    },
    {
      label: "roses_western flower thrips",
      arabic_name: "تربس الأزهار الغربي",
      scientific_name: "Frankliniella occidentalis",
      symptoms:
        "فى مرحلة مبكرة قبل تفتح الازهار تدخل الحشرة إلى البرعم الزهري حيث يتيح لها ذلك حجمها الصغير جدا وتتغذى الحشرات على حواف البتلات مسببة لها التشوه بدرجة كبيرة مع تطور الزهرة وتفتحها. يمكن ملاحظة حركة الحشرات على البتلات بعد التفتح إضافة إلى البقع الصغيرة غير المنتظمة الشكل على سطحي الورقة السفلي والعلوي ذات لون أحمر فاتح. يتلون سطح الورقة العلوي باللون الفضي في حالة الإصابة الشديدة وتفقد الزهرة قيمتها التسويقية بسبب العدد الكبير من الحشرات التي تظهر على البتلات بعد التفتح.",
      description:
        "تتصف حشره التربس بالوانها المختلفة فمنها الأصفر أو البني المحمر أو الأسود وهي صغيرة الحجم حيث يبلغ طولها ١ - ١,٥ ملم تقريبا ، تصيب انواع الورد المختلفة و تدخل الحشرة إلى البيوت المحمية عن طريق الأبواب وفتحات التهوية. يلاحظ بوضوح ضرر التربس الأحمر في الحدائق المنزلية وتعطي الحشرة عدة اجيال تصل إلى ٤ - ٨ أجيال في السنة الواحدة.",
      treatments:
        "1.\tتقليل أعدادها المتواجدة داخل البيت الزراعي عن طريق منع دخولها بواسطة الإغلاق المحكم المداخل التهوية والأبواب بالقماش العازل الناعم وهذة تعتبر اول خطوة من خطوات المكافحة بمنع الحشرة من الوصول للنباتات \r\n2.\tتعليق المصائد المناسبة  يفضل استعمال اللون الأزرق المحبب لحشرة التربس.\r\n3.\t ضرورة المراقبة الدورية للنباتات لاكتشاف بؤر الإصابة ومعالجتها بالرش الموضعي قبل الانتشار.\r\n4.\tالتخلص من البراعم والازهار المصابة ثم الرش بالمبيدات المتخصصة ومنها مبيدات البيروثرويدية أو الفسفورية العضوية أو الكارباماتية \r\n5.\tالتخلص من الأعشاب والحشائش الضارة داخل البيوت البلاستيكية وحولها والتي تعتبر مصدرا للإصابة.\r\n",
      stages: [],
      value: 45,
      created_at: "2025-01-20T20:03:26",
      updated_at: "2025-01-20T20:03:26",
    },
    {
      label: "honey bees_oriental hornet",
      arabic_name: "",
      scientific_name: "",
      symptoms: "",
      description: "",
      treatments: "",
      stages: [""],
      value: 59,
      created_at: "2025-02-18T19:41:12.696840",
      updated_at: "2025-02-18T19:41:12.696844",
    },
    {
      label: "coffee_leaf rust",
      arabic_name: "صدا اوراق البن ",
      scientific_name: "Hemileia vastatrix",
      symptoms:
        "يعتبر اهم مظهر من مظاهر العدوى هو ظهور بقع غير منتظمة الشكل على سطوح الأوراق العلوية. وهي مرتبطة بمسحوق لونة  اصفر إلى برتقالي  على أسطح الأوراق السفلية حيث توجد الجراثيم ويموت النسيج المصاب بعد ذلك. يجف النسيج ويتحول في النهاية إلى اللون البني. ومع تقدم الاصابة تسقط الأشجار المصابة الأوراق المصابة قبل الأوان. ينتج عن هذا فروع طويلة عارية. كما أنه يقلل من قدرة النبات على تحويل ضوء الشمس إلى طاقة. تؤثر هذه المشكلة على جودة وكمية ثمار البن.",
      description:
        "تتميز فطريات الصدا عن باقى الفطريات بانها تحتاج الى عائل حى لكى تتكاثر و تقوم فطريات الصدأ بذلك خلال دورة حياة معقدة تصل إلى خمس مراحل مختلفة من إنتاج الأبواغ.  تبدأ دورة  حياة المرض مع حدوث الإصابة بالجراثيم . تدخل الجراثيم بعد ذلك  إلى النبات خلال الفتحات الطبيعية على السطح السفلي من الاوراق. بعد دخول الجراثيم  ، تغزو الجراثيم الخلايا الأخرى للحصول على العناصر الغذائية وما تحتاجة لاستكمال دوره حياتها . و في النهاية يقتل الفطرالخلايا و ينتج جراثيم جديدة.   يتم إجبار هذه الجراثيم الجديدة على الخروج من خلال فتحات الأوراق. وبذلك  يتم نقلها عن طريق المطر بشكل اساسى ولكن أيضًا بسبب الرياح والحيوانات والانسان. وتبدا العدوى من جديد. تستغرق هذه العملية حوالي 4 إلى 7 أسابيع.  يمكن لبوغ واحد أن ينتج أربعة إلى ستة أجيال. تولد العدوى الفردية الأولية زيادة هائلة تصل إلى عشرات الآلاف من الجراثيم",
      treatments:
        "1.\tالتقليم الجيد  لاتاحة الفرصة للتهوية  وتقليل من نسبة الرطوبة.  \r\n2.\tإزالة النباتات الضعيفة أو القديمة أو المتأثرة بالفعل بأمراض أو آفات أخرى وحرقها خارج الحقل.\r\n3.\tاستخدام المبيدات الامنة والموصى بها حتى لا يحدث تاقلم ومقاومة للفطر لهذة المبيدات مع تنوع المبيدات من فترة لاخرى\r\n",
      stages: [],
      value: 25,
      created_at: "2025-01-20T16:17:49",
      updated_at: "2025-01-20T16:17:49",
    },
    {
      label: "coffee_miner",
      arabic_name: "حشرة حفار الاوراق ",
      scientific_name: "Leucoptera caffeina ",
      symptoms:
        "تظهر اعراض الاصابة بصانعات الانفاق على شكل  أنفاقا صغيرة بجوار العرق الرئيسي أو العروق الفرعية مع وجود اعداد كبيرة من ليرقات الصغيرة داخل الانفاق وتظهر الأنفاق بصورة بقع بنية واسعة غير منتظمة الحواف على كلا سطحي الورقة مع مرور الوقت و عند فرك البقع باليد تنفصل بشرة الورقة بسهولة. تؤدي الإصابة إلى جفاف الأوراق و تساقطها و خاصة عند الجفاف.",
      description:
        "تضع الأنثى حوالي 75 بيضة خلال أسبوعين بعد 4 – 3 أيام من خروجها من العذراء.وتوضع الحشرة البيض  فى شكل  صفوف على العرق الوسطي للورقة أو موزعا على العروق الفرعية. يفقس البيض بعد 2 – 1 أسابيع إلى يرقات و يأخذ الطور اليرقي فترة تتراوح بين 35 – 17 يوما. التعذر يكون على الأوراق الميتة أو الجافة في شرانق تتحول بعدها إلى حشرة كاملة خلال أسبوع أو أسبوعين. تختلف مدة دورة الحياة حسب درجة الحرارة و للحشرة 6 – 4 أجيال في السنة.",
      treatments:
        "1.\tالتخلص من الاوراق المصابة  والتى تحتوى على انفاق بجمعها وحرقها .\r\n2.\tتنظيم الري و عدم تعطيش أشجار البن يؤدي إلى التقليل من الإصابة. \r\n3.\tكما يمكن الإستفادة من مياه الأمطار و توجيهها نحو الأشجار المصابة.\r\n4.\tالرش بمبيدات متخصصة مثل: أبامكتين – إيمامكتين بنزوات – أندوكساكارب. و يكون الرش فعالا بعد حوالي أسبوع من ظهور الحشرة الكاملة لوضع البيض و فقسه إلى يرقات. حيث يتم عمل رشتين بفارق 10 – 7 أيام.\r\n5.\tاستخدام طفيل  التريكوجراما. و المفترسات مثل الدبابير.\r\n6.\tالإهتمام بالنظافة البستانية و التغذية المناسبة والمتوازنة خلال فترة موسم النمو للبن .\r\n",
      stages: [],
      value: 26,
      created_at: "2025-01-20T16:22:35",
      updated_at: "2025-01-20T16:22:35",
    },
    {
      label: "coffee_stem borer",
      arabic_name: "حفار الساق الابيض",
      scientific_name: "Monochamus leuconotus ",
      symptoms:
        "يظهر في قلف الجذوع والأفرع والأغصان المصابة شقوق دائرية يتساقط منها نشارة خشبية ناشئة عن غذاء الآفة ونواتج حفر أنفاقها، وتؤدى الإصابة إلى الأوعية الناقلة للماء، لذلك فإن الأجزاء التي تعلوا النفق الدائري تذبل ثم تموت الشجرة في النهاية.",
      description:
        "تضع الأنثى بيضها على لحاء الجزء السفلي من الجذع القريب من سطح الأرض وهذا هو المكان المفضل لها لوضع البيض ولكن يمكنها أن تضع بيضها في أي جزء آخر من الجذع أو الأفرع ، وبعد فقس البيض تخرج منه يرقات عديمة الأرجل يصل طول اليرقة من 4-5 سم ، ثم تأخذ اليرقة في الحفر في اللحاء حول الجذع،  وبعد ذلك تشرع في حفر نفق ضحل بطول 20 سم إلى أعلا في الجزء الخشبي، وفي نهاية هذا النفق تقوم اليرقة بالتعذر في تجويف للتعذير وتسده بسدادة من مخلفات الحفر، وتستغرق دورة الحياة في المتوسط نحو سنتين. ويفضل الحفار الأبيض مهاجمة البن اليمني arabica ونوع البن المعروف باسم robusta. وعندما تشتد الإصابة، يمكن أن يوجد في شجرة بن واحدة نحو ۱۸ يرقة.",
      treatments:
        "1.\tاختيار  الاصناف المناسبه والمقاومة عند الزراعة.\r\n2.\t الزراعة على مسافات تضمن التهوية الجيدة واختيار الظروف المناخية المناسبة \r\n3.\tالتغذية الجيدة باستعمال المخصبات المتوازنة \r\n4.\tكذلك يجب إزالة الأفرع الجافة والمصابة والأشجار الميته وإحراقها \r\n5.\tويمكن معالجة الشجرة المصابة كيميائيا بإزالة النشارة والفضلات من فتحات الأنفاق وشقوق القلف وحقنها بمعلق يحتوي على أي مبيد فوسفوري وبعدها نغلق الفتحات بعجينة جيرية، وقرب موعد إنهاء جيل من الحشرة وخروج اسراب أبي دقيق يمكن الرش بأحد المبيدات الحديثة المناسبة\r\n",
      stages: [],
      value: 27,
      created_at: "2025-01-20T16:28:16",
      updated_at: "2025-01-20T16:28:16",
    },
    {
      label: "honey bees_bee wolf",
      arabic_name: "ذئب النحل ",
      scientific_name: "Philanthus triangulum",
      symptoms:
        "اكتشاف نحل ميت أو مصاب بالقرب من الخلايا.      - نشاط مكثف للحشرات الطائرة حول الخلايا، خاصة في الأيام المشمسة.",
      description:
        "يهاجم ذئب النحل الخلايا أثناء الطيران، حيث يصطاد النحل ويخزنه ليفقس منها يرقاته.",
      treatments:
        "     - الحفاظ على حماية الخلايا باستخدام شبكات أو حواجز.\r\n     - يمكن استخدام الفخاخ أو المصائد الطبيعية لقتل ذئب النحل.\r\n     - الحد من تراكم النحل الميت حول الخلايا التي قد تجذب ذئب النحل.\r\n",
      stages: [],
      value: 34,
      created_at: "2025-01-20T16:36:13",
      updated_at: "2025-01-20T16:36:13",
    },
    {
      label: "honey bees_death's-head hawkmoth",
      arabic_name: "فراشة السمسم",
      scientific_name: "Cydia reticulana",
      symptoms:
        "تلف في الحبوب والأقراص الشمعية.      - وجود يرقات الفراشة داخل الأقراص أو في داخل مخزون العسل.",
      description:
        "- تعد الإصابة بهذه الفراشة أقل شيوعًا مقارنة بالحشرات الأخرى ولكنها تحدث عندما تتواجد خلايا النحل في بيئات رطبة أو غير نظيفة.",
      treatments:
        "     - تحسين ظروف التخزين والنظافة في الخلايا.\r\n     - استخدام مصائد أو فخاخ لجذب الفراشات والقضاء عليها.\r\n     - استخدام المبيدات الطبيعية في حالة الإصابة.\r\n",
      stages: [],
      value: 35,
      created_at: "2025-01-20T16:36:20",
      updated_at: "2025-01-20T16:36:20",
    },
    {
      label: "honey bees_wax moth",
      arabic_name: "دودة الشمع ",
      scientific_name: "Galleria mellonella",
      symptoms:
        "- تلف الشمع وبناء الأنفاق داخل الأقراص الشمعية.      - وجود يرقات دودة الشمع داخل الأقراص، مما يؤدي إلى انهيار خلايا النحل.",
      description:
        "- تكون الإصابة بدودة الشمع عادة في خلايا النحل التي تفتقر إلى العناية الجيدة أو التي تكون مهجورة أو ضعيفة.\r\n     - تنتشر عادة في الخلايا ذات النشاط المنخفض أو الخلايا التي تحتوي على شمع قديم.\r\n",
      treatments:
        "     - التخلص من الأقراص الشمعية القديمة أو التالفة.\r\n     - تحسين تهوية الخلايا لضمان عدم تراكم الرطوبة.\r\n     - استخدام مبيدات حشرية طبيعية أو متخصصة في حالة الإصابة الشديدة.\r\n     - تدفئة الأقراص في درجة حرارة مرتفعة لقتل اليرقات.\r\n",
      stages: [],
      value: 36,
      created_at: "2025-01-20T16:36:44",
      updated_at: "2025-01-20T16:36:44",
    },
    {
      label: "honey bees_bee louse",
      arabic_name: "قمل النحل ",
      scientific_name: "Braula coeca",
      symptoms:
        "     - ملاحظة الحشرات الصغيرة تتنقل على أجسام النحل.      - قلة نشاط النحل وضعف الخلايا.      - قد يصاحب الإصابة وجود قروح أو التهاب على الجسم الخارجي للنحل.",
      description:
        "     - قمل النحل يتغذى على إفرازات النحل ويضعف المناعة.\r\n     - يسبب تدهور صحة النحل في الحالات الشديدة.\r\n",
      treatments:
        "- يمكن مكافحة قمل النحل باستخدام المكملات الطبيعية مثل الزيوت الأساسية أو المبيدات الحيوية.\r\n     - نظافة الخلايا وتجنب التكاثر في الخلايا الضعيفة.\r\n",
      stages: [""],
      value: 58,
      created_at: "2025-02-18T19:40:17",
      updated_at: "2025-02-18T19:40:17",
    },
    {
      label: "honey bees_varroa",
      arabic_name: " الفاروا ",
      scientific_name: "Varroa destructor ",
      symptoms:
        "•\tوجود نحل زاحف غير قادر على الطيران. •\tمشاهدة إناث الفاروا بشكلها المميز عالقة على أجسام النحل. •\tصغر حجم الأفراد الناتجة من النحل. •\tخروج أفراد قزمية قصيرة البطن مشوهة الأرجل والأجنحة. •\tالحضنة المغلقة غير منتظمة المظهر. •\tظهور بقع محمرة على العذارى",
      description:
        "يعد حلم الفاروا V. destructor الآفة الأهم والأكثر تدميرا لطوائف نحل العسلA. mellifera على مستوى العالم. \r\n•\t يقوم بالتغذية على الأجسام الدهنية للعائل.\r\n•\t ينقل عددا من الفيروسات المهمة مثل فيروس الشلل الحاد (ABPV)، فيروس تشوه الأجنحة (DWV) وغيرها من الفيروسات التي ارتبط ظهورها بظاهرة إنهيار طوائف نحل العسل.\r\n•\t يؤدي إلى إضعاف مناعة الطائفة\r\n",
      treatments:
        "/ العلاج الكيماوي:\r\nمن اهم المعاملات التي تستخدم في علاج مرض الفاروا بنجاح ما يأتي:\r\n•\tمبيد الابيتول Apitol\r\n•\tمبيد البيريزين Perizin\r\n•\tشرائط الأبستان Apistan\t\r\n     2/ المواد الطبيعية النباتية:\r\nمنها النعناع، الحلبة، الكراوية، الكافور، الشيح البلدي والزعتر وغيرها.\r\n",
      stages: [""],
      value: 61,
      created_at: "2025-02-18T19:41:52",
      updated_at: "2025-02-18T19:41:52",
    },
    {
      label: "honey bees_stone brood",
      arabic_name: "تحجر الحضنة ",
      scientific_name: "Aspergilus",
      symptoms:
        "•\tتفقد اليرقات المصابة لمعانها الطبيعي. •\tغالبا تموت اليرقات بعد القفل عليها مباشرة، أي قبل التعذر، ولكن هناك بعض اليرقات التي قد تموت مبكرا قبل القفل عليها. •\tكصفة مميزة تتكون على اليرقات المصابة حلقة لونها أصفر مبيض تشبه الطوق أسفل الرأس نتيجة نمو الفطر على جلد اليرقة. •\tفي بداية الإصابة يصبح مظهر اليرقات قطيفيا، نتيجة لنمو الميسليوم على جدار الجسم، ثم بتقدم الإصابة يتحول لونها إلى اللون الأصفر المخضر.  •\tبعد مرور عدة أيام، تصبح اليرقة الميتة صلبة جدا ومتحجرة يصعب كسرها بالضغط عليها، ومن هنا جاءت تسمية المرض بتحجر الحضنة. •\tتمتلىء العيون التي تحوي اليرقات المصابة بالميسليوم والهيفات وجراثيم الفطر، التي يصعب على النحل إزالتها. •\tفقد شعيرات جسم النحل المصاب، وتظهر عليه أعراض الشلل فيتعرض لمهاجمة النحل السليم. •\tبعد موت النحل تتصلب البطن مشابها بذلك جسم اليرقات الميتة. •\tتتكون الجراثيم، وتظهر في المنطقة الواقعة بني الصدر والبطن. •\tتظهر نموات فطر A. flavus وجراثيمه بلون رمادي مخضر، بينما تظهر في حالة النوع  الثاني  A. fumigatus بلون أصفر مخضر، كما يصاحبها نوع ثالث  . A. Niger",
      description:
        "يمكن التأكد من المسبب المرضي والتعرف إليه بواسطة إنمائه على بيئة dec potato\r\nagar trose في المعمل، وفحص النموات بواسطة الميكروسكوب حتى يمكن رؤية الحوامل \r\nوالرؤوس الكونيدية.\r\n",
      treatments:
        "يمكن للنحل أن يتخلص من الإصابة الخفيفة من دون أي تدخل من النحال، على أن هناك بعض النواحي التي بمراعاتها نحمي النحل من الإصابة أو نساعده على التخلص منها وهي كالأتي:\r\n•\tتدفئة الطوائف بإجراءات التشتية الصحيحة عن طريق:\r\n1.\tوضع الخيش فوق قمة الأقراص.\r\n2.\tتعريض الخلايا لأشعة الشمس.\r\n3.\tالإقلال من فتح الخلايا في أثناء البرد وهبوب الرياح.\r\n4.\tتوفير الغذاء الطبيعي للنحل من عسل وحبوب لقاح بكمية كافية في الخلية في أثناء فصل الشتاء، وفي حالة نقصه أو عدم توافره يجب تعويضه بالتغذية الصناعية.\r\n•\tتغيير الملكات المسنة بالطوائف المصابة بإدخال ملكات عذارى تمت تربيتها في طوائف أخرى سليمة، مما يؤدي إلى:\r\n1.\tكسر دورة الحضنة، وإتاحة الفرصة للشغالات؛ للتخلص من المومياوات، التي تعد مصدرا لتجدد الإصابة.\r\n2.\tزيادة أعداد البيض نتيجة لنشاط الملكة الحديثة، فيعوض الفاقد من اليرقات الميتة.\r\n3.\tالعمل على زيادة أعداد النحل بالخلايا، حتى يقوم النحل بالتهوية والتخلص من الرطوبة الزائدة وثاني أكسيد الكربون، والذي يساعد وجودهما على نمو الجراثيم وانتشار المرض.\r\n4.\tاستخدام مصادر مختلفة من ملكات النحل الجيدة من مناطق مختلفة، بقصد تغيير التركيب الوراثي للنحل حتى يصبح مقاوما للإصابة. \r\n5.\tتوخي الحذر عند فحص الطوائف وإجراء العمليات النحلية المختلفة، لتفادي انتقال العدوى بين الطوائف.\r\n6.\tتجنب حدوث ظاهرة السرقة بين الطوائف بزيادة المسافات بين الخلايا.\r\n7.\tخفض الرطوبة داخل الخلايا وتهويتها بإزالة الخيش بعد انتهاء فترة التشتية، وتوسيع مداخل الخلايا.\r\n8.\tإضافة صناديق فارغة فوق صندوق التربية لتساعد على التهوية.\r\n9.\tفي حالة الإصابة الشديدة يمكن التخلص من أقراص الحضنة المصابة، أما الأقراص الفارغة وأدوات النحالة فيمكن تطهريها وإعادة استخدامها، بينما ينقل النحل الموجود بالخلايا المصابة إلى خلايا جديدة بها أقراص نظيفة أو أساسات شمعية.\r\n10.\tوضع بعض المواد مثل بلورات المنثول في أركان الخلية التي لها رائحة نفاذة، لتدفع الرائحة المنبعثة منها الشغالات الى التهوية.\r\nالمكافحة الكيماوية: Chemptherapy\r\nعلى الرغم من عدم توافر مواد كيماوية مسجلة بصورة تجارية لمكافحة المرض في الطوائف المصابة، إلى أن هناك بعض الأبحاث التي تؤكد نجاح بعض المواد الكيماوية في علاج المرض تحت الظروف الحقلية منها:\r\n•\tتغذية الطوائف على محلول سكري مضاف إليه حمض الأستيل سلساليك asetylsalicylic acid بمعدل 100ملجم/للطائفة أدى إلى خفض الإصابة بنسبة 8‚%95 بعد 24يوم من المعاملة. \r\n•\tتغذية الطائفة بمعدل 100 جم من فطائر مكملات حبوب اللقاح تحتوي على 100ملجم من حمض السلسليك salicylic acid أعطت نسبة خفض الإصابة بمقدار %90.\r\n•\tإضافة حمض الاسكوربك scorbic acid إلى محلول التغذية بمعدل 1‚% أدى إلى خفض الإصابة في الطوائف المعاملة بنسبة %50 (1981 ,Gochnauer and Nelson).\r\n•\tرش براويز الطوائف المصابة بمحلول سكري مضاف إليه حامض الأكساليك بمعدل 17جم/طائفة.\r\n",
      stages: [""],
      value: 60,
      created_at: "2025-02-18T19:41:28",
      updated_at: "2025-02-18T19:41:28",
    },
  ];

  // Validation schema using Yup
  const validationSchema = Yup.object().shape({
    plant: Yup.string().required(t("select_plant_required_key")),
    disease: Yup.string().required(t("select_disease_required_key")),
  });

  // Handle form submission
  const handleSubmit = (values) => {
    console.log("Form Values:", values);
    // Add your logic to handle form submission (e.g., API call)
  };

  return (
    <Formik
      enableReinitialize
      initialValues={{ plant: "", disease: "" }}
      validationSchema={validationSchema}
      onSubmit={handleSubmit}
    >
      {({ setFieldValue, errors, touched }) => (
        <Form className="flex items-end justify-between gap-4 w-full p-6 bg-white rounded-lg shadow-md ">
          {/* Plant Select Input */}
          <div className="w-[40%]">
            <Field name="plant">
              {({ field }) => (
                <SelectInput
                  label={t("select_plant_key")}
                  options={plantOptions}
                  value={plantOptions.find(
                    (option) => option.value === field.value
                  )}
                  onChange={(selectedOption) =>
                    setFieldValue("plant", selectedOption.value)
                  }
                  placeholder={t("select_plant_key")}
                />
              )}
            </Field>
            {errors.plant && touched.plant && (
              <div className="text-red-500 text-sm">{errors.plant}</div>
            )}
          </div>

          {/* Disease Select Input */}
          <div className="w-[40%]">
            <Field name="disease">
              {({ field }) => (
                <SelectInput
                  label={t("select_disease_key")}
                  options={diseaseOptions}
                  value={diseaseOptions.find(
                    (option) => option.value === field.value
                  )}
                  onChange={(selectedOption) =>
                    setFieldValue("disease", selectedOption.value)
                  }
                  placeholder={t("select_disease_key")}
                />
              )}
            </Field>
            {errors.disease && touched.disease && (
              <div className="text-red-500 text-sm">{errors.disease}</div>
            )}
          </div>

          {/* Get Data Button */}
          <Button type="submit" className="w-full">
            {t("get_data_key")}
          </Button>
        </Form>
      )}
    </Formik>
  );
};

export default PlantDiseaseForm;
